src/main/java/ru/vk/itmo/test/andreycheshev/lab2/wrk2-results/put_cpu_count_compare/count-x10_t-1_c-64_R-15000.txt
[andrey@archlinux wrk2]$ ./wrk -d 60 -t 1 -c 64 -s /home/andrey/andrey/scripts/put.lua -L -R 15000 http://localhost:8080/v0/entity/
Running 1m test @ http://localhost:8080/v0/entity/
  1 threads and 64 connections
  Thread calibration: mean lat.: 28.829ms, rate sampling interval: 150ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.56ms   21.81ms 212.86ms   86.49%
    Req/Sec    15.10k     2.31k   23.37k    76.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.94ms
 75.000%   27.89ms
 90.000%   48.99ms
 99.000%  103.93ms
 99.900%  158.59ms
 99.990%  186.24ms
 99.999%  203.01ms
100.000%  212.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            2         1.00
       2.561     0.100000        74721         1.11
       4.675     0.200000       149415         1.25
       6.967     0.300000       224112         1.43
       9.623     0.400000       298780         1.67
      12.943     0.500000       373523         2.00
      14.967     0.550000       410794         2.22
      17.327     0.600000       448185         2.50
      20.111     0.650000       485533         2.86
      23.583     0.700000       522833         3.33
      27.887     0.750000       560202         4.00
      30.431     0.775000       578809         4.44
      33.247     0.800000       597511         5.00
      36.383     0.825000       616222         5.71
      39.999     0.850000       634852         6.67
      44.191     0.875000       653507         8.00
      46.495     0.887500       662837         8.89
      48.991     0.900000       672203        10.00
      51.775     0.912500       681459        11.43
      55.071     0.925000       690812        13.33
      59.007     0.937500       700197        16.00
      61.311     0.943750       704868        17.78
      63.935     0.950000       709474        20.00
      67.071     0.956250       714183        22.86
      70.783     0.962500       718852        26.67
      75.071     0.968750       723503        32.00
      77.567     0.971875       725819        35.56
      80.383     0.975000       728137        40.00
      83.583     0.978125       730489        45.71
      87.295     0.981250       732823        53.33
      92.095     0.984375       735134        64.00
      95.167     0.985938       736313        71.11
      98.431     0.987500       737466        80.00
     101.823     0.989062       738643        91.43
     105.343     0.990625       739802       106.67
     109.119     0.992188       740970       128.00
     111.167     0.992969       741560       142.22
     113.407     0.993750       742146       160.00
     115.967     0.994531       742729       182.86
     119.039     0.995313       743309       213.33
     123.199     0.996094       743887       256.00
     125.887     0.996484       744176       284.44
     128.831     0.996875       744468       320.00
     132.351     0.997266       744759       365.71
     136.319     0.997656       745062       426.67
     140.927     0.998047       745343       512.00
     143.231     0.998242       745488       568.89
     146.687     0.998437       745637       640.00
     150.399     0.998633       745780       731.43
     154.879     0.998828       745925       853.33
     158.975     0.999023       746072      1024.00
     161.151     0.999121       746148      1137.78
     163.071     0.999219       746218      1280.00
     164.991     0.999316       746290      1462.86
     166.911     0.999414       746363      1706.67
     169.215     0.999512       746436      2048.00
     170.367     0.999561       746472      2275.56
     172.031     0.999609       746510      2560.00
     173.311     0.999658       746546      2925.71
     175.487     0.999707       746586      3413.33
     176.895     0.999756       746620      4096.00
     178.047     0.999780       746637      4551.11
     179.455     0.999805       746657      5120.00
     180.351     0.999829       746673      5851.43
     182.143     0.999854       746692      6826.67
     183.935     0.999878       746709      8192.00
     185.599     0.999890       746720      9102.22
     187.007     0.999902       746730     10240.00
     187.647     0.999915       746737     11702.86
     189.311     0.999927       746746     13653.33
     190.335     0.999939       746755     16384.00
     191.231     0.999945       746759     18204.44
     192.255     0.999951       746764     20480.00
     193.279     0.999957       746769     23405.71
     195.327     0.999963       746773     27306.67
     196.991     0.999969       746778     32768.00
     197.375     0.999973       746780     36408.89
     198.655     0.999976       746782     40960.00
     199.551     0.999979       746785     46811.43
     199.807     0.999982       746787     54613.33
     200.447     0.999985       746789     65536.00
     200.575     0.999986       746790     72817.78
     201.343     0.999988       746791     81920.00
     203.007     0.999989       746793     93622.86
     203.135     0.999991       746794    109226.67
     205.439     0.999992       746795    131072.00
     205.439     0.999993       746795    145635.56
     206.335     0.999994       746796    163840.00
     208.895     0.999995       746797    187245.71
     208.895     0.999995       746797    218453.33
     209.791     0.999996       746798    262144.00
     209.791     0.999997       746798    291271.11
     209.791     0.999997       746798    327680.00
     212.223     0.999997       746799    374491.43
     212.223     0.999998       746799    436906.67
     212.223     0.999998       746799    524288.00
     212.223     0.999998       746799    582542.22
     212.223     0.999998       746799    655360.00
     212.991     0.999999       746800    748982.86
     212.991     1.000000       746800          inf
#[Mean    =       20.562, StdDeviation   =       21.807]
#[Max     =      212.864, Total count    =       746800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  897330 requests in 1.00m, 57.34MB read
Requests/sec:  14953.77
Transfer/sec:      0.96MB